{
    "1": {
        "id": "1",
        "year": "1987",
        "title": "Egy rém rendes család123",
        "plot": "A sorozat főszereplője Al Bundy, egy szerencsétlen papucsférj a korábban sikeres középiskolai amerikaifutball-játékos, aki nőicipő-bolti eladóként dolgozik.",
        "cover": "https:\/\/upload.wikimedia.org\/wikipedia\/hu\/thumb\/f\/f6\/MWC_1.jpg\/375px-MWC_1.jpg",
        "episodes": {
            "6291f5e12247e": {
                "year": "1901",
                "title": "123213",
                "plot": "sdfadsf",
                "rating": "2",
                "id": "6291f5e12247e"
            },
            "6291f6c829040": {
                "year": "123213",
                "title": "tesztet",
                "plot": "qewre",
                "rating": "7.8",
                "id": "6291f6c829040"
            },
            "6291f87e2c8d1": {
                "year": "20000",
                "title": "valami értelmes cím",
                "plot": "dsadfsfsdf",
                "rating": "6",
                "id": "6291f87e2c8d1"
            }
        }
    },
    "62925f49c1edc": {
        "year": "2022",
        "title": "Obi Wan",
        "plot": "Star Wars sori",
        "cover": "https:\/\/cdn.pixabay.com\/photo\/2015\/12\/08\/15\/15\/robot-1083158_960_720.jpg",
        "episodes": {
            "62925ffa5e2a3": {
                "year": "2022",
                "title": "Egy új remény",
                "plot": "asdsadasdsadas",
                "rating": "9.8",
                "id": "62925ffa5e2a3"
            }
        },
        "id": "62925f49c1edc"
    },
    "62975d02d163c": {
        "year": "2014",
        "title": "Szilícium-völgy",
        "plot": "Az alkotó Mike Judge, a történet főhőse pedig az introvertált programozó, Richard, aki barátaival úgy határoz, saját vállalkozásba fog. A Szilícium-völgyben pedig minden esély meg is van a sikerhez!",
        "cover": "https:\/\/dmdamedia.hu\/kepek\/szilicium_volgy_poster.jpg",
        "episodes": {
            "629761ec68b33": {
                "year": "2014",
                "title": "Korlátozott funkcionalitású termék",
                "plot": "Egy számítógépes programozó, Richard, olyan számítógépes algoritmust fejleszt ki, amely minden eddiginél jobban tömöríti a fájlokat. Richard egy programozókkal teli házban él, és a Hooli nevű számítógépes cégnek dolgozik. Amikor Richard bemutatja az ötletét, Gavin Belson, a Hooli vezetője 10 milliót ajánl neki. Míg egy másik milliárdos 200 000-et ajánl neki a cég 5%-áért. Richardnak el kell döntenie, hogy azonnal eladja-e a cégét, vagy maradjon mellette, és felhasználja a Peter Gregory által nyújtott finanszírozást.",
                "rating": "7.4",
                "id": "629761ec68b33"
            },
            "6297632f6eb23": {
                "year": "2016",
                "title": "A doboz",
                "plot": "Az új és továbbfejlesztett Pied Piper lenyűgözi Dinesh-t és Gilfoyle-t, de aggasztja Richardot; Jared és Erlich lakhatási problémákkal szembesül; Gavin ellentmondásos lépést javasol.",
                "rating": "8",
                "id": "6297632f6eb23"
            },
            "629764c6f2c97": {
                "year": "2019",
                "title": "Hooli-Hop",
                "plot": "A sarokba szorítva Richard együtt érez az egykori riválisával. Dinesh jobb ember szeretne lenni, annak érdekében, hogy helyrehozza a rossz szerencséjét. A dühös Jared, azért, hogy segítsen Gwarton, vonakodva ugyan, de hajlandó együtt dolgozni Richarddal. Monica egy drasztikus lépésre tesz javaslatot, aminek következtében a Pied Piper csapata versenyt fut az idővel, hogy sikeresen lezárjon egy nagy munkát.",
                "rating": "9",
                "id": "629764c6f2c97"
            },
            "62976548a1318": {
                "year": "2018",
                "title": "Műszaki igazgató",
                "plot": "Richard lelkesedése egy másik cég felelős vezetője iránt súrlódás okoz a Pier Piper tagjaival. Eredetileg Jared arra buzdította Richardot, hogy barátkozzon össze Danával, egy másik cég hasonló gondolkodású vezérigazgatójával, azonban Richard érdeklődését Dana helyett annak kedves alvezére kelti fel, aki arra készteti, hogy megkérdőjelezze a Gilfoyle iránti lojalitását. Dinesh korlátozott lakhatási lehetőségekkel szembesül, ezért új szobatársat keres. Hamarosan sikerrel jár.",
                "rating": "8.2",
                "id": "62976548a1318"
            }
        },
        "id": "62975d02d163c"
    },
    "629784cfeff98": {
        "year": "2015",
        "title": "Mr. Robot",
        "plot": "A fiatal programozó, Elliot nappal biztonsági szakemberként dolgozik, míg az éjszakáit hackerkedéssel, és rossz emberek lekapcsolásával tölti. Az egyik éjszaka internetes támadást észlel az E(vil) Corp ellen. Amikor próbálja kideríteni, hogy ki a felelős a DDoS támadásért, szembekerül a rejtélyes Mr. Robottal, és annak még különösebb szervezetével.",
        "cover": "https:\/\/dmdamedia.hu\/kepek\/mr_robot_poster.jpg",
        "episodes": {
            "629789d01c17d": {
                "year": "2015",
                "title": "helló_barátom.mov",
                "plot": "Az MR. ROBOT-ban Elliot, aki nappal kiberbiztonsági mérnök, éjjel pedig önbíráskodó hacker, egy titokzatos földalatti csoport felbérli, hogy pusztítsa el a céget, amelynek védelmére fizetik. Elliotnak el kell döntenie, meddig megy el, hogy leleplezze azokat az erőket, amelyek szerinte a világot irányítják (és tönkreteszik).",
                "rating": "9.2",
                "id": "629789d01c17d"
            },
            "62978a0e8cdc0": {
                "year": "2019",
                "title": "egyesek_és_nullák.mpeg",
                "plot": "Elliot visszautasítja Tyrell állásajánlatát, mondván, hogy boldog ott, ahol most van, azaz Gideonnak dolgozik az AllSafe-nél. Gideon megköszöni neki, hogy megmentette a céget, és fizetésemelést ajánl neki. A munkából hazatérve Elliot a lakásában találja Darlene-t. Vonattal mennek az fsociety raktárába, ahol találkozik Mr. Robottal, aki megpróbálja meggyőzni, hogy folytassák a közösen elkezdett hackelést. Elliot azonban nem biztos benne, hogy ezt tovább akarja folytatni, és még azt is fontolgatja, hogy feladja őket.",
                "rating": "8.5",
                "id": "62978a0e8cdc0"
            },
            "62978a52ec132": {
                "year": "2019",
                "title": "d3bug.mkv",
                "plot": "Tyrellnek nem adnak esélyt arra, hogy meggyőzze a céget, ő a megfelelő személy Colby helyére. Hogy némi vigasztaláshoz jusson, fizet valakinek, hogy verjék meg. Ezután közelebb kerül a főnöke titkárnőjéhez, hogy információkat szerezzen az új CTO-ról. Elliot a kórházban ébred, ahol Krista és Shayla figyel rá. Meg kell győznie Kristát, hogy jól van, de ez nem okoz gondot, hiszen könnyen bejut a kórház adatbázisába. Elliot úgy gondolja, hogy az fsociety végzett vele, és azt tervezi, hogy új életet kezd - egy normális életet. Ezért magával viszi Shaylát egy vacsorára Gideonhoz. Mivel az fsociety újabb információkat fed fel Colbyról, Elliot megtudja, hogy a játéknak még nincs vége. Közben Ollie-t megzsarolják.",
                "rating": "8.1",
                "id": "62978a52ec132"
            },
            "62978a9a772a8": {
                "year": "2019",
                "title": "da3m0ns.mp4",
                "plot": "Miközben Elliot megpróbálja átvészelni a morfium elvonási tüneteit, és tisztába jön, megpróbálja megtalálni a módját, hogy egyszer és mindenkorra elpusztítsa az E Corp-ot. Rájön, hogy neki és az fsociety-nek talán van esélye, de az időkorlátok nagyon szorosak. Mivel az ő ötlete volt, Elliot úgy dönt, hogy neki kell az Acélhegyre mennie. Az állapota azonban néhány óra alatt rosszabbra fordul, és a hallucinációi is egyre sötétebbek és intenzívebbek lesznek. A barátjában csalódott Angela úgy dönt, hogy a problémáit úgy kezeli, hogy elfogad egy kis segítséget Shaylától. Darlene és Trenton megpróbálják maguk mellé állítani a kínaiakat.",
                "rating": "7.9",
                "id": "62978a9a772a8"
            },
            "62978ac003875": {
                "year": "2019",
                "title": "3xpl0its.wmv",
                "plot": "Elliot, Romero és Mobley az Acélhegyre tart. Elliot Mobley segítségével megy be, aki egy hamis Wikipedia-oldalt hoz létre a nevében. Elliot találkozik Tyrell Wellickkel, akivel együtt ebédel. Ez tökéletes alkalom Elliot számára, hogy teljesítse küldetését. Ekkor tudja meg Elliot, hogy Tyrell a nyomában van. Angela végleg elhagyja Olivert, és visszatér az apjához. Tyrell és Johanna meglátogatják Knowle-ékat. Darlene elveszíti Kínát.",
                "rating": "8.4",
                "id": "62978ac003875"
            },
            "62978aebd0941": {
                "year": "2019",
                "title": "br4ve-trave1er.asf",
                "plot": "Vera túszul ejti Shaylát a bátyjával, hogy befolyásolja Elliotot, hogy meghekkelje őt a börtönből, Elliot pedig kétségbeesetten próbál egy hatékony tervet kitalálni; Angela ügyvédekkel veszi fel a kapcsolatot az anyja halálával kapcsolatban, és Elliotot keresi fel tanácsért; Scott tartja magát Tyrell fölött.",
                "rating": "9.1",
                "id": "62978aebd0941"
            },
            "62978b11ceede": {
                "year": "2019",
                "title": "v1ew-s0urce.flv",
                "plot": "Elliot emlékszik arra, amikor először találkozott Shaylával. Angela ráveszi az ügyvédjét, hogy szervezzen meg egy találkozót közte és Colby között. Colby meg akarja vesztegetni, de Angela nem hátrál meg. A ravasz Colbytól azonban nem azt kapja, amit szeretne, de így is sikerül lenyűgöznie. Darlene egy bárban beszélget Mr. Robottal. Ezután Mr. Robot meglátogatja Romerót. Tyrell kirúg néhány embert a csapatából, és lépéseket tesz Ms Knowles felé. Gideon attól fél, hogy az All Safe-nak van-e jövője. Elliot váratlan és őszinte látogatást tesz a pszichiáterénél.",
                "rating": "8.4",
                "id": "62978b11ceede"
            },
            "62978b6326ba1": {
                "year": "2019",
                "title": "wh1ter0se.m4v",
                "plot": "Az All Safet feltörték.  Elliot 3 perces találkozót tart Whiterose-zal. Elmondják neki, hogy figyelmetlen volt Gideonnal, de ezt hamar helyrehozza. Tyrell találkozik Mr. Robottal. Aztán meglátogatja őt két NYPD nyomozó. Ekkor Johanna megsebesíti magát, hogy megakadályozza Tyrell lebukását. Elliot végre emlékszik az igazi személyazonosságára.",
                "rating": "9.4",
                "id": "62978b6326ba1"
            },
            "62978b930fbae": {
                "year": "2019",
                "title": "m1rr0r1ng.qt",
                "plot": "Angela felmond az Allsafe-nél, és állásajánlatot kap Colbytól. Mr. Robot beugrik Elliot lakásába, ami felidézi Elliot gyermekkori emlékeit. Tyrellt elbocsátják az Evil Corp-tól, és meglepetésszerűen meglátogatja Elliotot, aki már nem tudja megmondani, mi a valóság és mi nem.",
                "rating": "9.2",
                "id": "62978b930fbae"
            },
            "62978bf19b651": {
                "year": "2019",
                "title": "zer0-day.avi",
                "plot": "Elliot mindenhol Tyrellt keresi, és kiborul, amikor a világ káoszba borul; Angela az új munkahelyén tanúja lesz valami traumatikusnak, és részt vesz egy sajtótájékoztatón a vezérigazgatóval; a fsociety elégeti a bizonyítékokat, és ünnepel; Lenny találkozik Kristával Elliotról; \"...ahogy nézte, ahogy Róma ég.\".",
                "rating": "8.7",
                "id": "62978bf19b651"
            }
        },
        "id": "629784cfeff98"
    }
}